# -------- Модулі для повторення --------
import ast
import random

# Вбудовані модулі:

# import sqlite3
# import random - генерує рандомне число, витягує рандомні елементи, працюють з послідовністю і випадковістю.
# import math
# import tkinter
# import os - використовується з роботою ОС, шляхами, файлами, папками та іншими утилітами
# import string
# import webbrowser
# import calendar
# import threading
# import time
# import datetime
# import sys
# import decimal
# import pprint
# import re
# import fractions - робота з дробами і арифметичними операціями і їх скорочення
# import abc
# import shutil - використовується для роботи з каталогом файлів такі як: копіювання, переміщення, створення резервних копій тощо
# import ast - дозволяє працювати з кодом Python - його абстрактним синтаксичним деревом,
# для зміни структури коду Python, використовується для виконання безпечно - коду, аналізу і обробки та створення інструментів

# - Модуль os -
# import os
# os.path.exists() - повертає висновок про присутності самого файла
# os.remove() - видаляє сам файл
# os.makedirs() - сворює в дерективі папку
# os.rmdir() - видаляє папку з дерективи

# - Модуль shutil -
# import shutil
# shutil.copy() - копіює і вставляє файл

# - Модуль fractions -
# import fractions
# fractions.Fraction() - скорочує дріб і подає його у людському вигляді

# - Модуль ast -
# ast.literal_eval() - функція, яка безпечно перетворює рядок на один з типів даних Python, не виконуючи код

# - Модуль random -
# random.randint() - генерує випадкове число в заданому діапазоні

# Не вбудовані модулі:

# import My SQL
# import Telebot
# import beautifulsoup4
# import PyGame
# import requests

# ---------------------------------------

# Flask - фреймворк для створення веб-додатків на мові програму
# Django - фреймворк для створення веб-додатків на мові програмування Python
# SQL - мова програмування для роботи з базами даних
# FastAPI - фреймворк для створення веб-додатків на мові програмування Python
# Git - система керування версіями
# Docker - платформа для розробки, доставки та запуску застосунків